MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX210F016D.atdf
         <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCA" />
            <bitfield mask="0x00000002" name="ODCA" />
            <bitfield mask="0x00000004" name="ODCA" />
            <bitfield mask="0x00000008" name="ODCA" />
            <bitfield mask="0x00000010" name="ODCA" />
            <bitfield mask="0x00000020" name="ODCA" />
            <bitfield mask="0x00000040" name="ODCA" />
            <bitfield mask="0x00000080" name="ODCA" />
            <bitfield mask="0x00000100" name="ODCA" />
            <bitfield mask="0x00000200" name="ODCA" />
            <bitfield mask="0x00000400" name="ODCA" />
            <bitfield mask="0x00000800" name="ODCA" />
            <bitfield mask="0x00001000" name="ODCA" />
            <bitfield mask="0x00002000" name="ODCA" />
            <bitfield mask="0x00004000" name="ODCA" />
            <bitfield mask="0x00008000" name="ODCA" />
         </register>
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC" />
            <bitfield mask="0x00000002" name="ODCC" />
            <bitfield mask="0x00000004" name="ODCC" />
            <bitfield mask="0x00000008" name="ODCC" />
            <bitfield mask="0x00000010" name="ODCC" />
            <bitfield mask="0x00000020" name="ODCC" />
            <bitfield mask="0x00000040" name="ODCC" />
            <bitfield mask="0x00000080" name="ODCC" />
            <bitfield mask="0x00000100" name="ODCC" />
            <bitfield mask="0x00000200" name="ODCC" />
            <bitfield mask="0x00000400" name="ODCC" />
            <bitfield mask="0x00000800" name="ODCC" />
            <bitfield mask="0x00001000" name="ODCC" />
            <bitfield mask="0x00002000" name="ODCC" />
            <bitfield mask="0x00004000" name="ODCC" />
            <bitfield mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUA" />
            <bitfield mask="0x00000002" name="CNPUA" />
            <bitfield mask="0x00000004" name="CNPUA" />
            <bitfield mask="0x00000008" name="CNPUA" />
            <bitfield mask="0x00000010" name="CNPUA" />
            <bitfield mask="0x00000020" name="CNPUA" />
            <bitfield mask="0x00000040" name="CNPUA" />
            <bitfield mask="0x00000080" name="CNPUA" />
            <bitfield mask="0x00000100" name="CNPUA" />
            <bitfield mask="0x00000200" name="CNPUA" />
            <bitfield mask="0x00000400" name="CNPUA" />
            <bitfield mask="0x00000800" name="CNPUA" />
            <bitfield mask="0x00001000" name="CNPUA" />
            <bitfield mask="0x00002000" name="CNPUA" />
            <bitfield mask="0x00004000" name="CNPUA" />
            <bitfield mask="0x00008000" name="CNPUA" />
         </register>
         <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUB" />
            <bitfield mask="0x00000002" name="CNPUB" />
            <bitfield mask="0x00000004" name="CNPUB" />
            <bitfield mask="0x00000008" name="CNPUB" />
            <bitfield mask="0x00000010" name="CNPUB" />
            <bitfield mask="0x00000020" name="CNPUB" />
            <bitfield mask="0x00000040" name="CNPUB" />
            <bitfield mask="0x00000080" name="CNPUB" />
            <bitfield mask="0x00000100" name="CNPUB" />
            <bitfield mask="0x00000200" name="CNPUB" />
            <bitfield mask="0x00000400" name="CNPUB" />
            <bitfield mask="0x00000800" name="CNPUB" />
            <bitfield mask="0x00001000" name="CNPUB" />
            <bitfield mask="0x00002000" name="CNPUB" />
            <bitfield mask="0x00004000" name="CNPUB" />
            <bitfield mask="0x00008000" name="CNPUB" />
         </register>
         <register caption="" name="CNPUC" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUC" />
            <bitfield mask="0x00000002" name="CNPUC" />
            <bitfield mask="0x00000004" name="CNPUC" />
            <bitfield mask="0x00000008" name="CNPUC" />
            <bitfield mask="0x00000010" name="CNPUC" />
            <bitfield mask="0x00000020" name="CNPUC" />
            <bitfield mask="0x00000040" name="CNPUC" />
            <bitfield mask="0x00000080" name="CNPUC" />
            <bitfield mask="0x00000100" name="CNPUC" />
            <bitfield mask="0x00000200" name="CNPUC" />
            <bitfield mask="0x00000400" name="CNPUC" />
            <bitfield mask="0x00000800" name="CNPUC" />
            <bitfield mask="0x00001000" name="CNPUC" />
            <bitfield mask="0x00002000" name="CNPUC" />
            <bitfield mask="0x00004000" name="CNPUC" />
            <bitfield mask="0x00008000" name="CNPUC" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA" />
            <bitfield mask="0x00000002" name="CNPDA" />
            <bitfield mask="0x00000004" name="CNPDA" />
            <bitfield mask="0x00000008" name="CNPDA" />
            <bitfield mask="0x00000010" name="CNPDA" />
            <bitfield mask="0x00000020" name="CNPDA" />
            <bitfield mask="0x00000040" name="CNPDA" />
            <bitfield mask="0x00000080" name="CNPDA" />
            <bitfield mask="0x00000100" name="CNPDA" />
            <bitfield mask="0x00000200" name="CNPDA" />
            <bitfield mask="0x00000400" name="CNPDA" />
            <bitfield mask="0x00000800" name="CNPDA" />
            <bitfield mask="0x00001000" name="CNPDA" />
            <bitfield mask="0x00002000" name="CNPDA" />
            <bitfield mask="0x00004000" name="CNPDA" />
            <bitfield mask="0x00008000" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB" />
            <bitfield mask="0x00000002" name="CNPDB" />
            <bitfield mask="0x00000004" name="CNPDB" />
            <bitfield mask="0x00000008" name="CNPDB" />
            <bitfield mask="0x00000010" name="CNPDB" />
            <bitfield mask="0x00000020" name="CNPDB" />
            <bitfield mask="0x00000040" name="CNPDB" />
            <bitfield mask="0x00000080" name="CNPDB" />
            <bitfield mask="0x00000100" name="CNPDB" />
            <bitfield mask="0x00000200" name="CNPDB" />
            <bitfield mask="0x00000400" name="CNPDB" />
            <bitfield mask="0x00000800" name="CNPDB" />
            <bitfield mask="0x00001000" name="CNPDB" />
            <bitfield mask="0x00002000" name="CNPDB" />
            <bitfield mask="0x00004000" name="CNPDB" />
            <bitfield mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC" />
            <bitfield mask="0x00000002" name="CNPDC" />
            <bitfield mask="0x00000004" name="CNPDC" />
            <bitfield mask="0x00000008" name="CNPDC" />
            <bitfield mask="0x00000010" name="CNPDC" />
            <bitfield mask="0x00000020" name="CNPDC" />
            <bitfield mask="0x00000040" name="CNPDC" />
            <bitfield mask="0x00000080" name="CNPDC" />
            <bitfield mask="0x00000100" name="CNPDC" />
            <bitfield mask="0x00000200" name="CNPDC" />
            <bitfield mask="0x00000400" name="CNPDC" />
            <bitfield mask="0x00000800" name="CNPDC" />
            <bitfield mask="0x00001000" name="CNPDC" />
            <bitfield mask="0x00002000" name="CNPDC" />
            <bitfield mask="0x00004000" name="CNPDC" />
            <bitfield mask="0x00008000" name="CNPDC" />
         </register>
         <register caption="" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONC" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
